loan-application-service/ci/artillery.yml
config:
  environments:
    testing:
      phases:
        - duration: 5
          arrivalRate: 1
    qa:
      phases: #Ramp up arrival rate from 10 to 50 over 2 minutes, followed by 10 minutes at 50 arrivals per second
        - duration: 120
          arrivalRate: 10
          rampTo: 50
          name: "Warm up the application"
        - duration: 600
          arrivalRate: 50
          name: "Sustained max load"
scenarios:
  - flow:
    #- log: "Current environment is set to: {{ $environment }}"
    - get:
        url: "/"
    #- post:
    #   url: "/info"
    #   headers:
      #    X-My-Header: "123"
      #  json:
      #    Message: "This is some info"
      #    MessageTypeId: 1
      #  capture:
    #- post:
      #  url: "/search"
      #  json:
      #    Id: 1
      #    Message: null
      #    MessageTypeId: null
      #  capture:
      #    json: "$.id"
      #    as: "result"